# CurveLoops Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainCell..::..CurveLoops Property
CurtainCell Class See Also
---
The cell boundaries on the reference face. The boundaries can have more than one CurveLoop. Each item in the returned array represents a CurveLoop containing 3 or more than 3 edges.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArrArray CurveLoops { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurveLoops As CurveArrArray
	Get
```

Visual C++
---
```text
public:
property CurveArrArray^ CurveLoops {
	CurveArrArray^ get ();
}
```

# See Also
CurtainCell Class
Autodesk.Revit.DB Namespace